Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_uart.h
  uint8_t                       *pRxBuffPtr;      /*!< Pointer to UART Rx transfer Buffer */

  uint32_t                      RxXferSize;       /*!< UART Rx Transfer size              */

  __IO uint32_t                 RxXferCount;      /*!< UART Rx Transfer Counter           */

  DMA_HandleTypeDef             *hdmatx;          /*!< UART Tx DMA Handle parameters      */

  DMA_HandleTypeDef             *hdmarx;          /*!< UART Rx DMA Handle parameters      */

  HAL_LockTypeDef               Lock;             /*!< Locking object                     */

  __IO HAL_UART_StateTypeDef    gState;           /*!< UART state information related to global Handle management
                                                       and also related to Tx operations.
                                                       This parameter can be a value of @ref HAL_UART_StateTypeDef */

  __IO HAL_UART_StateTypeDef    RxState;          /*!< UART state information related to Rx operations.
                                                       This parameter can be a value of @ref HAL_UART_StateTypeDef */

  __IO uint32_t                 ErrorCode;        /*!< UART Error code                    */

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
  void (* TxCpltCallback)(struct __UART_HandleTypeDef *huart);            /*!< UART Tx Complete Callback             */
  void (* RxCpltCallback)(struct __UART_HandleTypeDef *huart);            /*!< UART Rx Complete Callback             */
  void (* TxBlockCpltCallback)(struct __UART_HandleTypeDef *huart);       /*!< UART Tx Block Complete Callback       */
  void (* TxHalfBlockCpltCallback)(struct __UART_HandleTypeDef *huart);   /*!< UART Tx Half Block Complete Callback  */
  void (* TxSrcCpltCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Tx Source Complete Callback      */
  void (* RxBlockCpltCallback)(struct __UART_HandleTypeDef *huart);       /*!< UART Rx Block Complete Callback       */
  void (* RxHalfBlockCpltCallback)(struct __UART_HandleTypeDef *huart);   /*!< UART Rx Half Block Complete Callback  */
  void (* RxDstCpltCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Rx Destination Complete Callback */
  void (* ErrorCallback)(struct __UART_HandleTypeDef *huart);             /*!< UART Error Callback                   */
  void (* AbortCpltCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Abort Complete Callback          */
  void (* AbortTransmitCpltCallback)(struct __UART_HandleTypeDef *huart); /*!< UART Abort Transmit Complete Callback */
  void (* AbortReceiveCpltCallback)(struct __UART_HandleTypeDef *huart);  /*!< UART Abort Receive Complete Callback  */
  void (* BreakFrameCallback)(struct __UART_HandleTypeDef *huart);        /*!< UART Break Frame Detection Callback   */
  void (* AddrMatchCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Address Match Callback           */

  void (* MspInitCallback)(struct __UART_HandleTypeDef *huart);           /*!< UART Msp Init callback                */
  void (* MspDeInitCallback)(struct __UART_HandleTypeDef *huart);         /*!< UART Msp DeInit callback              */
#endif  /* USE_HAL_UART_REGISTER_CALLBACKS */

} UART_HandleTypeDef;

#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL UART Callback ID enumeration definition
  */
typedef enum
{
  HAL_UART_TX_COMPLETE_CB_ID             = 0x00U,    /*!< UART Tx Complete Callback ID             */
  HAL_UART_RX_COMPLETE_CB_ID             = 0x01U,    /*!< UART Rx Complete Callback ID             */
  HAL_UART_TX_BLOCK_COMPLETE_CB_ID       = 0x02U,    /*!< UART Tx Block Complete Callback ID       */
  HAL_UART_TX_HALF_BLOCK_COMPLETE_CB_ID  = 0x03U,    /*!< UART Tx Half Block Complete Callback ID  */
  HAL_UART_TX_SRC_COMPLETE_CB_ID         = 0x04U,    /*!< UART Tx Source Complete Callback ID      */
  HAL_UART_RX_BLOCK_COMPLETE_CB_ID       = 0x05U,    /*!< UART Rx Block Complete Callback ID       */
  HAL_UART_RX_HALF_BLOCK_COMPLETE_CB_ID  = 0x06U,    /*!< UART Rx Half Block Complete Callback ID  */
  HAL_UART_RX_DST_COMPLETE_CB_ID         = 0x07U,    /*!< UART Rx Destination Complete Callback ID */
  HAL_UART_ERROR_CB_ID                   = 0x08U,    /*!< UART Error Callback ID                   */
  HAL_UART_ABORT_COMPLETE_CB_ID          = 0x09U,    /*!< UART Abort Complete Callback ID          */
  HAL_UART_ABORT_TRANSMIT_COMPLETE_CB_ID = 0x0AU,    /*!< UART Abort Transmit Complete Callback ID */
  HAL_UART_ABORT_RECEIVE_COMPLETE_CB_ID  = 0x0BU,    /*!< UART Abort Receive Complete Callback ID  */
  HAL_UART_BREAK_FRAME_CB_ID             = 0x0CU,    /*!< UART Break Frame Detection Callback ID   */
  HAL_UART_ADDR_MATCH_CB_ID              = 0x0DU,    /*!< UART Address Match Callback ID           */

  HAL_UART_MSPINIT_CB_ID                 = 0x0EU,    /*!< UART MspInit callback ID                 */
  HAL_UART_MSPDEINIT_CB_ID               = 0x0FU     /*!< UART MspDeInit callback ID               */

} HAL_UART_CallbackIDTypeDef;

/**
  * @brief  HAL UART Callback pointer definition
  */
typedef  void (*pUART_CallbackTypeDef)(UART_HandleTypeDef *huart);  /*!< pointer to an UART callback function */

#endif /* USE_HAL_UART_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup UART_Exported_Constants UART Exported Constants
  * @{
  */

/** @defgroup UART_Error_Code UART Error Code
  * @{
  */
#define HAL_UART_ERROR_NONE              0x00000000U   /*!< No error            */
#define HAL_UART_ERROR_ORE               0x00000001U   /*!< Overrun error       */
#define HAL_UART_ERROR_PE                0x00000002U   /*!< Parity error        */
#define HAL_UART_ERROR_FE                0x00000004U   /*!< Frame error         */
#define HAL_UART_ERROR_BUSY              0x00000008U   /*!< BUSY error          */
#define HAL_UART_ERROR_DMA               0x00000010U   /*!< DMA transfer error  */
#if (USE_HAL_UART_REGISTER_CALLBACKS == 1)
#define  HAL_UART_ERROR_INVALID_CALLBACK 0x00000020U   /*!< Invalid Callback error  */
#endif /* USE_HAL_UART_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup UART_Word_Length UART Word Length
  * @{
  */
#define UART_WORDLENGTH_5B                  0x00000000U
#define UART_WORDLENGTH_6B                  ((uint32_t)UART_CR1_M_0)
#define UART_WORDLENGTH_7B                  ((uint32_t)UART_CR1_M_1)
#define UART_WORDLENGTH_8B                  ((uint32_t)(UART_CR1_M_1) | (UART_CR1_M_0))
#define UART_WORDLENGTH_9B                  0xFFFFFFFFU
/**
  * @}
  */
  
