Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_uart.h
/** @addtogroup UART_Exported_Functions_Group3
  * @{
  */
/* Peripheral Control functions  ************************************************/
HAL_StatusTypeDef HAL_UART_StartSendBreak(UART_HandleTypeDef *huart);
HAL_StatusTypeDef HAL_UART_StopSendBreak(UART_HandleTypeDef *huart);
/**
  * @}
  */

/** @addtogroup UART_Exported_Functions_Group4
  * @{
  */
/* Peripheral State functions  **************************************************/
HAL_UART_StateTypeDef HAL_UART_GetState(UART_HandleTypeDef *huart);
uint32_t              HAL_UART_GetError(UART_HandleTypeDef *huart);
/**
  * @}
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup UART_Private_Macros UART Private Macros
  * @{
  */

#define IS_UART_WORD_LENGTH(LENGTH) (((LENGTH) == UART_WORDLENGTH_5B) || \
                                     ((LENGTH) == UART_WORDLENGTH_6B) || \
                                     ((LENGTH) == UART_WORDLENGTH_7B) || \
                                     ((LENGTH) == UART_WORDLENGTH_8B) || \
                                     ((LENGTH) == UART_WORDLENGTH_9B))

#define IS_UART_STOPBITS(STOPBITS) (((STOPBITS) == UART_STOPBITS_1) || \
                                    ((STOPBITS) == UART_STOPBITS_1_5_OR_2))

#define IS_UART_PARITY(PARITY) (((PARITY) == UART_PARITY_NONE) || \
                                ((PARITY) == UART_PARITY_EVEN) || \
                                ((PARITY) == UART_PARITY_ODD)  || \
                                ((PARITY) == UART_PARITY_STICKY_0)  || \
                                ((PARITY) == UART_PARITY_STICKY_1))

#define IS_UART_MSB_FIRST(MSB) (((MSB) == UART_MSB_FIRST_DISABLE) || \
                                ((MSB) == UART_MSB_FIRST_ENABLE))

#define IS_UART_TX_MODE(MODE) (((MODE) == UART_TX_MODE_0) || \
                               ((MODE) == UART_TX_MODE_1))

#define IS_UART_RX_MODE(MODE) (((MODE) == UART_RX_ADDR_MATCH_SOFT) || \
                               ((MODE) == UART_RX_ADDR_MATCH_HARD))

#define IS_UART_RX_MATCH_ADDR(ADDR) ((ADDR) <= 0xFF)

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32E407_HAL_UART_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
